using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Game
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("                             The World of Hell");
            Console.WriteLine("Предыстория: В 1537 году произошёл катаклизм, который 10 лет спустя станет известен как Совмещение. После череды таинственных событий совместились два мира: Мир Людей(Нирн) и Мир Демонов(Ад). Последствия оказались катастрофическими. В Нирн просочилась энергия Ада, превращая людей в страшных чудовищ. Однако некоторые люди смогли выжить и сохранить человеческий облик. Они начали строить королевства, успешно защищаясь от чудищ, во многом благодаря поддержке Сил Рая(Эллизиума). Некоторые воины смогли получить способности, черпая энергию из Эллизиума и становясь Паладинами, а многие из наиболее отважных воинов смогли подчинить себе силу Ада и стали Демоническими Рыцарями. Начинают появляться Кошмары - воины, являющиеся концентрацией силы ранее скрытого четвёртого мира: Тьмы. Многие воины вооружились копьями, а некоторые смогли объединить в себе частичку сил Тьмы и Ада, став Разрушителями. Раньше магов недолюбливали, но теперь они являются желанными гостями в любом королевстве. Многие маги в основном сражаются при помощи магии стихий, но некторые черпают силы из Эллизиума(Капеллан) или из Тьмы(Некроманты). Ассассинов теперь часто нанимают, чтобы они убили определённого сильного Демона, но некоторые сами охотятся на них, используя силы Тьмы. Таких называют Повелителями Смерти. Лучники славятся своей возможностью поразить врага стрелой с огромного расстояния, вследствии чего они так же являются частью любой армии или просто желанными гостями.");
            Console.WriteLine("  Нынешнее время: 1547 год. Воина продолжается. Люди успешно сражаются с силами Ада и, если приходится, Тьмы. В одном из королевств, именуемым Дримфоллом, живёт один совершенно обычный крестьянин, планирующий сражаться с Демонами, но не планирующий идти в армию, так что ему самому придётся обучаться. Пока ещё никто, даже он сам, не знает о том, что он был избран древними силами.");
            Console.Write("Введите имя: ");
            Console.ReadLine();
        }
    }
}
